#include <cmath>
#include <zephyr/utils/pyplot.h>

using namespace zephyr;

enum class TestRes { Curve, Sphere, Torus };

void plot_results(TestRes test) {
    std::vector<double> hs, cdiff, PY, csir, elvira, csir3;
    std::vector<double> two_h(2), first(2), second(2);

    if (test == TestRes::Curve) {
        // Данные теста с двумерной кривой
        hs = { 0.04, 0.02, 0.01, 0.005, 0.0025, 0.00125, 0.000625 };
        cdiff  = { 1.04e-02, 5.31e-03, 2.66e-03, 1.33e-03, 6.67e-04, 3.33e-04, 1.67e-04 };
        PY     = { 3.17e-03, 9.21e-04, 3.45e-04, 1.56e-04, 7.61e-05, 3.71e-05, 1.85e-05 };
        elvira = { 3.39e-03, 7.65e-04, 1.62e-04, 4.03e-05, 1.00e-05, 2.51e-06, 6.34e-07 };
        csir   = { 2.64e-03, 5.92e-04, 1.39e-04, 3.50e-05, 8.77e-06, 2.15e-06, 5.47e-07 };
        csir3  = csir;

        two_h = {0.04, 0.000625};
        first[0] = 5.0e-3;
        first[1] = first[0] * two_h[1] / two_h[0];

        second[0] = 1.0e-3;
        second[1] = second[0] * std::pow(two_h[1] / two_h[0], 2);
    }
    else if (test == TestRes::Sphere) {
        // Данные теста со сферой
        hs = { 0.14286, 0.09091, 0.04545, 0.02273, 0.01136, 0.00568, 0.00284, 0.00142};
        cdiff  = { 1.43e-02, 1.17e-02, 5.95e-03, 3.12e-03, 1.59e-03, 7.97e-04, 4.00e-04, 2.00e-04 };
        PY     = { 4.08e-03, 2.21e-03, 9.50e-04, 4.51e-04, 2.23e-04, 1.11e-04, 5.55e-05, 2.77e-05 };
        csir   = { 4.63e-03, 2.12e-03, 7.75e-04, 3.07e-04, 1.34e-04, 6.35e-05, 3.13e-05, 1.55e-05 };
        elvira = { 4.98e-03, 1.98e-03, 5.54e-04, 1.45e-04, 3.81e-05, 9.88e-06, 2.60e-06, 6.87e-07 };
        csir3  = { 4.98e-03, 2.10e-03, 5.81e-04, 1.49e-04, 3.83e-05, 9.65e-06, 2.44e-06, 6.34e-07 };

        two_h = {0.14286, 0.00142};
        first[0] = 8.0e-3;
        first[1] = first[0] * two_h[1] / two_h[0];

        second[0] = 2.1e-3;
        second[1] = second[0] * std::pow(two_h[1] / two_h[0], 2);
    }
    else if (test == TestRes::Torus) {
        // Данные теста с тором
        hs = { 0.14286, 0.09091, 0.04545, 0.02273, 0.01136, 0.00568, 0.00284, 0.00142};
        cdiff  = { 2.72e-02, 1.83e-02, 9.20e-03, 4.70e-03, 2.38e-03, 1.19e-03, 5.94e-04, 2.97e-04 };
        PY     = { 1.67e-02, 6.76e-03, 1.91e-03, 7.35e-04, 3.27e-04, 1.56e-04, 7.65e-05, 3.80e-05 };
        csir   = { 1.82e-02, 7.62e-03, 2.06e-03, 6.25e-04, 2.18e-04, 9.13e-05, 4.21e-05, 2.04e-05 };
        elvira = { 2.41e-02, 9.46e-03, 2.06e-03, 5.04e-04, 1.25e-04, 3.16e-05, 8.09e-06, 2.08e-06 };
        csir3  = { 1.86e-02, 7.36e-03, 1.82e-03, 4.74e-04, 1.20e-04, 2.99e-05, 7.52e-06, 1.91e-06 };

        two_h = {0.14286, 0.00142};
        first[0] = 1.5e-2;
        first[1] = first[0] * two_h[1] / two_h[0];

        second[0] = 7.0e-3;
        second[1] = second[0] * std::pow(two_h[1] / two_h[0], 2);
    }

    utils::pyplot plt;

    plt.figure({.figsize={5.4, 3.6}, .dpi=250});

    plt.grid(true);
    plt.xlabel("Linear cell size");
    plt.ylabel("Error");

    plt.loglog(two_h, first, {.linestyle="dotted", .color="black"});
    plt.loglog(two_h, second, {.linestyle="dotted", .color="black"});

    plt.loglog(hs, cdiff, {.color="tab:gray", .marker=".", .label="Cent. Diff."});
    plt.loglog(hs, PY, {.color="tab:green", .marker=".", .label="P&Y"});
    if (test != TestRes::Curve) {
        plt.loglog(hs, csir, {.color="tab:blue", .marker=".", .label="CSIR"});
        plt.loglog(hs, elvira, {.color="gold", .marker=".", .label="ELVIRA"});
        plt.loglog(hs, csir3, {.linestyle="dashed", .color="darkorchid", .marker=".", .label="CSIR$^3$"});
    }
    else {
        plt.loglog(hs, elvira, {.color="gold", .marker=".", .label="ELVIRA"});
        plt.loglog(hs, csir, {.color="tab:blue", .marker=".", .label="CSIR"});
    }

    plt.legend();
    plt.tight_layout();
    plt.show();
}

int main() {
    plot_results(TestRes::Curve);
    plot_results(TestRes::Sphere);
    plot_results(TestRes::Torus);
    return 0;
}

/*
Двумерный тест (L1 norm)
hx       hy          Central      Youngs      ELVIRA       CSIR
0.04000, 0.04000:    1.04e-02    3.17e-03    3.39e-03    2.64e-03
0.02000, 0.02000:    5.31e-03    9.21e-04    7.65e-04    5.92e-04
0.01000, 0.01000:    2.66e-03    3.45e-04    1.62e-04    1.39e-04
0.00500, 0.00500:    1.33e-03    1.56e-04    4.03e-05    3.50e-05
0.00250, 0.00250:    6.67e-04    7.61e-05    1.00e-05    8.77e-06
0.00125, 0.00125:    3.33e-04    3.71e-05    2.51e-06    2.15e-06
0.00062, 0.00062:    1.67e-04    1.85e-05    6.34e-07    5.47e-07

Двумерный тест (L_inf norm)
hx, hy               Central      Youngs      ELVIRA       CSIR
0.04000, 0.04000:    9.88e-02    3.06e-02    7.57e-02    3.68e-02
0.02000, 0.02000:    9.45e-02    3.13e-02    4.64e-02    1.91e-02
0.01000, 0.01000:    9.55e-02    1.17e-02    1.37e-02    1.06e-02
0.00500, 0.00500:    9.53e-02    1.06e-02    7.92e-03    7.80e-03
0.00250, 0.00250:    9.53e-02    1.00e-02    4.28e-03    3.61e-03
0.00125, 0.00125:    9.55e-02    9.84e-03    2.40e-03    1.88e-03
0.00062, 0.00062:    9.55e-02    9.98e-03    1.56e-03    1.31e-03

Тест со сферой, сходимость в L1 норме
hx, hy, hz                    Central      Youngs     CSIR  2D     ELVIRA     CSIR  3D
0.14286, 0.14286, 0.14286:    1.43e-02    4.08e-03    4.63e-03    4.98e-03    4.98e-03
0.09091, 0.09091, 0.09091:    1.17e-02    2.21e-03    2.12e-03    1.98e-03    2.10e-03
0.04545, 0.04545, 0.04545:    5.95e-03    9.50e-04    7.75e-04    5.54e-04    5.81e-04
0.02273, 0.02273, 0.02273:    3.12e-03    4.51e-04    3.07e-04    1.45e-04    1.49e-04
0.01136, 0.01136, 0.01136:    1.59e-03    2.23e-04    1.34e-04    3.81e-05    3.83e-05
0.00568, 0.00568, 0.00568:    7.97e-04    1.11e-04    6.35e-05    9.88e-06    9.65e-06
0.00284, 0.00284, 0.00284:    4.00e-04    5.55e-05    3.13e-05    2.60e-06    2.44e-06
0.00142, 0.00142, 0.00142:    2.00e-04    2.77e-05    1.55e-05    6.87e-07    6.34e-07

Тест со сферой, сходимость в L_inf норме
hx, hy, hz                    Central      Youngs     CSIR  2D     ELVIRA     CSIR  3D
0.14286, 0.14286, 0.14286:    6.14e-02    1.30e-02    1.58e-02    2.06e-02    1.75e-02
0.09091, 0.09091, 0.09091:    8.85e-02    1.06e-02    1.03e-02    1.12e-02    1.06e-02
0.04545, 0.04545, 0.04545:    1.00e-01    1.15e-02    1.79e-02    8.43e-03    5.54e-03
0.02273, 0.02273, 0.02273:    1.05e-01    1.18e-02    1.83e-02    5.02e-03    2.96e-03
0.01136, 0.01136, 0.01136:    1.04e-01    1.17e-02    1.80e-02    3.14e-03    1.55e-03
0.00568, 0.00568, 0.00568:    1.06e-01    1.19e-02    1.80e-02    1.94e-03    8.56e-04
0.00284, 0.00284, 0.00284:    1.06e-01    1.19e-02    1.81e-02    2.69e-03    7.62e-04
0.00142, 0.00142, 0.00142:    1.06e-01    1.19e-02    1.81e-02    3.51e-03    1.17e-03

Тест для тора, сходимость в L1 норме
hx, hy, hz                    Central      Youngs     CSIR  2D     ELVIRA     CSIR  3D
0.14286, 0.14286, 0.14286:    2.72e-02    1.67e-02    1.82e-02    2.41e-02    1.86e-02
0.09091, 0.09091, 0.09091:    1.83e-02    6.76e-03    7.62e-03    9.46e-03    7.36e-03
0.04545, 0.04545, 0.04545:    9.20e-03    1.91e-03    2.06e-03    2.06e-03    1.82e-03
0.02273, 0.02273, 0.02273:    4.70e-03    7.35e-04    6.25e-04    5.04e-04    4.74e-04
0.01136, 0.01136, 0.01136:    2.38e-03    3.27e-04    2.18e-04    1.25e-04    1.20e-04
0.00568, 0.00568, 0.00568:    1.19e-03    1.56e-04    9.13e-05    3.16e-05    2.99e-05
0.00284, 0.00284, 0.00284:    5.94e-04    7.65e-05    4.21e-05    8.09e-06    7.52e-06
0.00142, 0.00142, 0.00142:    2.97e-04    3.80e-05    2.04e-05    2.08e-06    1.91e-06

Тест для тора, сходимость в L_inf норме
hx, hy, hz                    Central      Youngs     CSIR  2D     ELVIRA     CSIR  3D
0.14286, 0.14286, 0.14286:    7.10e-02    4.33e-02    3.85e-02    9.82e-02    3.83e-02
0.09091, 0.09091, 0.09091:    9.45e-02    3.01e-02    2.77e-02    7.00e-02    2.48e-02
0.04545, 0.04545, 0.04545:    1.02e-01    1.71e-02    1.97e-02    2.51e-02    1.38e-02
0.02273, 0.02273, 0.02273:    1.03e-01    1.30e-02    1.83e-02    1.32e-02    7.12e-03
0.01136, 0.01136, 0.01136:    1.05e-01    1.23e-02    1.83e-02    7.98e-03    3.74e-03
0.00568, 0.00568, 0.00568:    1.06e-01    1.19e-02    1.81e-02    4.12e-03    1.89e-03
0.00284, 0.00284, 0.00284:    1.06e-01    1.19e-02    1.81e-02    3.47e-03    1.44e-03
0.00142, 0.00142, 0.00142:    1.06e-01    1.19e-02    1.82e-02    2.40e-03    1.70e-03
*/