#include <cstdint>
#include <zephyr/utils/pyplot.h>

#include <zephyr/mesh/side.h>

using namespace zephyr;
using namespace zephyr::mesh;

/// @brief Полная группа перестановок куба.
/// Всего 48 элементов, я их сгенерировал каким-то скриптиком в python,
/// элементы записаны в форме перестановок индексов вершин куба.
static const std::array<std::array<std::uint8_t, 8>, 48> cube_symmetries = { std::array<std::uint8_t, 8>
    {0, 1, 2, 3, 4, 5, 6, 7}, {0, 1, 4, 5, 2, 3, 6, 7}, {0, 2, 1, 3, 4, 6, 5, 7},
    {0, 2, 4, 6, 1, 3, 5, 7}, {0, 4, 1, 5, 2, 6, 3, 7}, {0, 4, 2, 6, 1, 5, 3, 7},
    {1, 0, 3, 2, 5, 4, 7, 6}, {1, 0, 5, 4, 3, 2, 7, 6}, {1, 3, 0, 2, 5, 7, 4, 6},
    {1, 3, 5, 7, 0, 2, 4, 6}, {1, 5, 0, 4, 3, 7, 2, 6}, {1, 5, 3, 7, 0, 4, 2, 6},
    {2, 0, 3, 1, 6, 4, 7, 5}, {2, 0, 6, 4, 3, 1, 7, 5}, {2, 3, 0, 1, 6, 7, 4, 5},
    {2, 3, 6, 7, 0, 1, 4, 5}, {2, 6, 0, 4, 3, 7, 1, 5}, {2, 6, 3, 7, 0, 4, 1, 5},
    {3, 1, 2, 0, 7, 5, 6, 4}, {3, 1, 7, 5, 2, 0, 6, 4}, {3, 2, 1, 0, 7, 6, 5, 4},
    {3, 2, 7, 6, 1, 0, 5, 4}, {3, 7, 1, 5, 2, 6, 0, 4}, {3, 7, 2, 6, 1, 5, 0, 4},
    {4, 0, 5, 1, 6, 2, 7, 3}, {4, 0, 6, 2, 5, 1, 7, 3}, {4, 5, 0, 1, 6, 7, 2, 3},
    {4, 5, 6, 7, 0, 1, 2, 3}, {4, 6, 0, 2, 5, 7, 1, 3}, {4, 6, 5, 7, 0, 2, 1, 3},
    {5, 1, 4, 0, 7, 3, 6, 2}, {5, 1, 7, 3, 4, 0, 6, 2}, {5, 4, 1, 0, 7, 6, 3, 2},
    {5, 4, 7, 6, 1, 0, 3, 2}, {5, 7, 1, 3, 4, 6, 0, 2}, {5, 7, 4, 6, 1, 3, 0, 2},
    {6, 2, 4, 0, 7, 3, 5, 1}, {6, 2, 7, 3, 4, 0, 5, 1}, {6, 4, 2, 0, 7, 5, 3, 1},
    {6, 4, 7, 5, 2, 0, 3, 1}, {6, 7, 2, 3, 4, 5, 0, 1}, {6, 7, 4, 5, 2, 3, 0, 1},
    {7, 3, 5, 1, 6, 2, 4, 0}, {7, 3, 6, 2, 5, 1, 4, 0}, {7, 5, 3, 1, 6, 4, 2, 0},
    {7, 5, 6, 4, 3, 1, 2, 0}, {7, 6, 3, 2, 5, 4, 1, 0}, {7, 6, 5, 4, 3, 2, 1, 0}
};

/// @brief Элемент группы симметрии куба, записан в виде перестановки вершин.
struct cube_symmetry {
    std::uint8_t number;

    cube_symmetry(int val) : number(val) {
        z_assert(0 <= val && val < 48);
    }

};


// ЧТО НАМ НУЖНО? Для быстрого связывания, для быстрого определения индекса соседней ячейки.


// Дано i - номер вершины [0,.. 7).
// s - проста сторона.
// T - перестановка по этой стороне.
// Также фактически позволяет определить индекс смежной дочерней ячейки,
// если i - индекс дочерней ячейки, то возвращает индекс смежной через
// грань s дочерней ячейки у соседа. Нужна прям.
int node_index(int i, Side3D s, cube_symmetry T) {
    return -1;
}

// Индекс смежной БАЗОВОЙ стороны для LEFT вернет RIGHT в простом случае и т.д.
Side3D opp_face_base(Side3D s, cube_symmetry T) {
    return -1;
}

// Индекс смежной сложной стороны.
// К примеру, моя ячейка разбилась. Нужна ли ?
Side3D opp_face_full(Side3D s, cube_symmetry T) {
    return -1;
}


int main() {


    return 0;
}