#pragma once
#include <cstdint>
#include <array>

namespace zephyr::mesh {

/// @brief Полная группа симметрий квадрата. Всего 8 элементов, элементы группы
/// перечислены в виде перестановок вершин.
inline constexpr std::array<std::array<uint8_t, 4>, 8>
quad_symmetries = { std::array<uint8_t, 4>
    {0, 1, 2, 3}, {0, 3, 2, 1}, {1, 0, 3, 2}, {1, 2, 3, 0},
    {2, 1, 0, 3}, {2, 3, 0, 1}, {3, 0, 1, 2}, {3, 2, 1, 0}
};

/// @brief Полная группа симметрий куба. Всего 48 элементов, элементы группы
/// перечислены в виде перестановок вершин (сгенерировал в python).
inline constexpr std::array<std::array<std::uint8_t, 8>, 48>
cube_symmetries = { std::array<std::uint8_t, 8>
    {0, 1, 2, 3, 4, 5, 6, 7}, {0, 1, 4, 5, 2, 3, 6, 7}, {0, 2, 1, 3, 4, 6, 5, 7},
    {0, 2, 4, 6, 1, 3, 5, 7}, {0, 4, 1, 5, 2, 6, 3, 7}, {0, 4, 2, 6, 1, 5, 3, 7},
    {1, 0, 3, 2, 5, 4, 7, 6}, {1, 0, 5, 4, 3, 2, 7, 6}, {1, 3, 0, 2, 5, 7, 4, 6},
    {1, 3, 5, 7, 0, 2, 4, 6}, {1, 5, 0, 4, 3, 7, 2, 6}, {1, 5, 3, 7, 0, 4, 2, 6},
    {2, 0, 3, 1, 6, 4, 7, 5}, {2, 0, 6, 4, 3, 1, 7, 5}, {2, 3, 0, 1, 6, 7, 4, 5},
    {2, 3, 6, 7, 0, 1, 4, 5}, {2, 6, 0, 4, 3, 7, 1, 5}, {2, 6, 3, 7, 0, 4, 1, 5},
    {3, 1, 2, 0, 7, 5, 6, 4}, {3, 1, 7, 5, 2, 0, 6, 4}, {3, 2, 1, 0, 7, 6, 5, 4},
    {3, 2, 7, 6, 1, 0, 5, 4}, {3, 7, 1, 5, 2, 6, 0, 4}, {3, 7, 2, 6, 1, 5, 0, 4},
    {4, 0, 5, 1, 6, 2, 7, 3}, {4, 0, 6, 2, 5, 1, 7, 3}, {4, 5, 0, 1, 6, 7, 2, 3},
    {4, 5, 6, 7, 0, 1, 2, 3}, {4, 6, 0, 2, 5, 7, 1, 3}, {4, 6, 5, 7, 0, 2, 1, 3},
    {5, 1, 4, 0, 7, 3, 6, 2}, {5, 1, 7, 3, 4, 0, 6, 2}, {5, 4, 1, 0, 7, 6, 3, 2},
    {5, 4, 7, 6, 1, 0, 3, 2}, {5, 7, 1, 3, 4, 6, 0, 2}, {5, 7, 4, 6, 1, 3, 0, 2},
    {6, 2, 4, 0, 7, 3, 5, 1}, {6, 2, 7, 3, 4, 0, 5, 1}, {6, 4, 2, 0, 7, 5, 3, 1},
    {6, 4, 7, 5, 2, 0, 3, 1}, {6, 7, 2, 3, 4, 5, 0, 1}, {6, 7, 4, 5, 2, 3, 0, 1},
    {7, 3, 5, 1, 6, 2, 4, 0}, {7, 3, 6, 2, 5, 1, 4, 0}, {7, 5, 3, 1, 6, 4, 2, 0},
    {7, 5, 6, 4, 3, 1, 2, 0}, {7, 6, 3, 2, 5, 4, 1, 0}, {7, 6, 5, 4, 3, 2, 1, 0}
};

/// @brief Элемент группы симметрий квадрата или куба. Несмотря на название,
/// включает не только вращения, но и отражения. Группа симметрий квадрата
/// содержит 8 элементов, группа симметрий куба содержит 24 элемента.
/// Элементы групп нумеруются от 0 некоторым образом, которые перечислены
/// в соответствующих таблицах. Естественно, нейтральный элемент для обеих
/// групп имеет индекс равный нулю.
template <int dim>
struct Rotation {
    std::uint8_t num;  ///< Номер в списке преобразований

    /// @brief Число элементов группы перестановок
    static constexpr uint8_t group_size = dim == 2 ? 8 : 24;

    /// @brief Создание по индексу
    constexpr Rotation(uint8_t r) noexcept : num(r) {}

    /// @brief Преобразование в индекс
    constexpr operator uint8_t() const noexcept { return num; }

};

using Rotation2D = Rotation<2>;
using Rotation3D = Rotation<3>;

} // namespace zephyr::mesh